[
  {
    "id": "17662",
    "subcode": "17CV662",
    "subname": "ENVIRONMENTAL PROTECTION AND MANAGEMENT",
    "m1": "Module 1",
    "m1desc": "Environmental Management Standard:\nUnique Characteristics of Environmental Problems - Systems approach to Corporate environmental management  - Classification of Environmental Impact Reduction Efforts -Business Charter for Sustainable Production and Consumption – Tools, Business strategy drivers and Barriers - Evolution of Environmental Stewardship. Environmental Management Principles - National policies on environment, abatement of pollution and conservation of resources - Charter on Corporate responsibility for Environmental protection.",
    "m2": "Module 2",
    "m2desc": "Environmental Management Objectives:\nEnvironmental quality objectives – Rationale of Environmental standards: Concentration and Mass standards, Effluent and stream standards, Emission and ambient standards, Minimum national standards, environmental performance evaluation: Indicators, benchmarking. Pollution control  Vs Pollution Prevention - Opportunities and Barriers – Cleaner production and Clean technology, closing the loops, zero discharge technologies.",
    "m3": "Module 3",
    "m3desc": "Environmental Management System:\nEMAS, ISO 14000 - EMS as per ISO 14001– benefits and barriers of EMS – Concept of continual improvement and pollution prevention  - environmental policy – initial environmental review – environmental aspect and impact analysis – legal and other requirements- objectives and targets – environmental management programs – structure and responsibility – training awareness and competence- communication – documentation and document control – operational control – monitoring and measurement – management review.",
    "m4": "Module 4",
    "m4desc": "Environmental Audit:\nEnvironmental management system audits  as per ISO 19011-  – Roles and qualifications of auditors - Environmental performance indicators and their evaluation – Non conformance – Corrective and preventive actions -compliance audits – waste audits and waste minimization planning – Environmental statement (form V) - Due diligence audit.",
    "m5": "Module 5",
    "m5desc": "Application:\nApplications of EMS , Waste Audits and Pollution Prevention opportunities in Textile , Sugar, Pulp & Paper, Electroplating, ,  Tanning industry, Dairy, Cement, Chemical industries, etc. Trans boundary movement, disposal, procedures, of hazardous wastes.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/civil-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/civil-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/civil-json-files/",
    "qbscreenparams": ""
  }
]
