[
  {
    "id": "17663",
    "subcode": "17CV663",
    "subname": " NUMERICAL METHODS AND APPLICATIONS ",
    "m1": "Module 1",
    "m1desc": "Solution of Equations and Eigen value Problems:\nSolution of algebraic and transcendental equations, Fixed point iteration method, Newton Raphson method, Solution of linear system of equations, Gauss elimination method, Pivoting, Gauss Jordan method – Iterative methods of Gauss Jacobi and Gauss Seidel - Matrix Inversion by Gauss Jordan method.",
    "m2": "Module 2",
    "m2desc": "Interpolation and Approximation:\nInterpolation with unequal intervals - Lagrange's interpolation – Newton’s divided difference interpolation – Cubic Splines - Interpolation with equal intervals - Newton’s forward and backward difference formulae.",
    "m3": "Module 3",
    "m3desc": "Numerical Differentiation and Integration:\nApproximation of derivatives using interpolation polynomials - Numerical integration using Trapezoidal, Simpson’s 1/3 rule – Romberg’s method - Two point and three point Gaussian quadrature formulae – Evaluation of double integrals by Trapezoidal and Simpson’s 1/3 rules.",
    "m4": "Module 4",
    "m4desc": "Initial Value Problems for Ordinary Differential Equations :\nSingle Step methods - Taylor’s series method - Euler’s method - Modified Euler’s method – Fourth order RungeKutta method for solving first order equations - Multi step methods - Milne’s and AdamsBash forth predictor corrector methods for solving first order equations.",
    "m5": "Module 5",
    "m5desc": "Boundary Value Problems in Ordinary and Partial Differential Equations:\nFinite difference methods for solving two-point linear boundary value problems - Finite difference techniques for the solution of two dimensional Laplace’s and Poisson’s equations on rectangular domain – One dimensional heat flow equation by explicit and implicit (Crank Nicholson) methods – One dimensional wave equation by explicit method.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/civil-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/civil-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/civil-json-files/",
    "qbscreenparams": ""
  }
]
