[{
    "_id": "2090",
    "subcode": "17AE561",
    "subname": "HISTORY OF FLIGHT & TECHNOLOGY FORECAST",
    "m1": "Module 1",
    "m1desc": "Introduction \nEarly Developments – Ornithopters, Balloon Flight, Sir George Cayley–The true inventor of Airplane, the Interregnum, Otto Lilienthal–The Glider Man, Percy Pilcher–Extending the Glider Tradition.",
    "m2": "Module 2",
    "m2desc": "Wilbur and Orville Wright: \nInventors of First Practical Airplane, Aeronautical Triangle–Langley,Wrights and Glenn Curtiss, Problem of Propulsion, Faster and Higher, biplanes and monoplanes, Developments in aerodynamics, materials, structures and propulsion over the years.",
    "m3": "Module 3",
    "m3desc": "Aircraft Configurations: \nDifferent types of flight vehicles, classifications. Components of an airplane and their functions. Conventional control, Powered control, Basic instruments for flying - Typical systems for control actuation.",
    "m4": "Module 4",
    "m4desc": "Airplane Structures and Materials: \nGeneral types of construction, Monocoque, semi-monocoque and geodesic constructions, Typical wing and fuselage structure. Metallic and non-metallic materials, Use of aluminium alloy, titanium, stainless steel and composite materials. Stresses and strains – Hooke’s law – Stress - strain diagrams - elastic constants.",
    "m5": "Module 5",
    "m5desc": "Power Plants: \nBasic ideas about piston, turboprop and jet engines - Use of propeller and jets for thrust production - Comparative merits, Principles of operation of rocket, types of rockets and typical applications, Exploration into space.",
    "descname": "Prescribed text books",
    "descdata": "Text Books: \n1. Anderson, J.D., “Introduction to Flight”, McGraw-Hill, 1995.  \n2. Stephen. A. Brandt, Introduction to Aeronautics: A design perspective, 2nd Edition, AIAA    Education Series, 2004.. \n\nReference Books:  \n1. Kermode, A.C., “Mechanics of Flight”, Himalayan Book, 1997 \n2. Kermode, A.C., “Flight without Formula”, Pearson, 2009.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
