[{
    "_id": "2080",
    "subcode": "17AE554",
    "subname": "AIRCRAFT ELECTRICAL SYSTEMS & INSTRUMENTATION",
    "m1": "Module 1",
    "m1desc": "Airplane Control Systems: \nConventional Systems, fully powered flight controls, Power actuated systems, Modern control systems, Digital fly by wire systems, Auto pilot system active control technology.",
    "m2": "Module 2",
    "m2desc": "Aircraft Systems: \nHydraulic systems, Study of typical workable system, components, Pneumatic systems, Advantages, Working principles, Typical Air pressure system, Brake system, Typical Pneumatic power system, Components, Landing Gear systems, Classification.",
    "m3": "Module 3",
    "m3desc": "Engine Systems: \nFuel systems for Piston and jet engines, Components of multi engines. lubricating systems for piston and jet engines-Starting and Ignition systems-Typical examples for piston and jet engines.",
    "m4": "Module 4",
    "m4desc": "Auxiliary System: \nBasic Air cycle systems, Vapour Cycle systems, Evaporative vapour cycle systems, Evaporative air cycle systems, Fire protection systems, Deicing and anti-icing systems.",
    "m5": "Module 5",
    "m5desc": "Aircraft Instruments: \nFlight Instruments and Navigation Instruments, Gyroscope, Accelerometers, Air speed Indicators, TAS, EAS, Mach Meters, Altimeters, Principles and operation, Study of various types of engine instruments, Tachometers, Temperature gauges, Pressure gauges, Operation and Principles.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books: \n1. Ian Moirand Allan Seabridge, ‘Aircraft Systems: Mechanical, Electrical and Avionics-Subsystem Integration’, Wiley India Pvt Ltd, 3rd edition, 2012, ISBN-13: 978-8126535217. \n2. Pallet, E.H.J., “Aircraft Instruments and Integrated Systems”, Longman Scientific and Technical, 1996.  \n\nReference Books:  \n1. Lalit Gupta and OP. Sharma, ‘Aircraft Systems (Fundamentals of Flight Vol. IV)’, HimalayanBooks;2006. \n2. Treager. S, “Gas Turbine Technology”, McGraw-Hill, 3rd edition,2013, ISBN-13: 978-1259064876. \n3. R.W. Sloley and W.H. Coulthard, ‘The aircraft Engineers Handbook, No 4, Instruments’, 6 th Edition, 2005, ISBN-13: 978-8175980518 \n4. SR.Majumdar,‘Pneumatic Systems’, Tata McGraw Hill Publishing Co,1st Edition, 2001, ISBN-13: 978-0074602317. \n5. William A Neese, ‘Aircraft Hydraulic Systems’, Himalayan Books, 2007.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
