[{
    "_id": "2070",
    "subcode": "17AE553",
    "subname": "THEORY OF VIBRATIONS",
    "m1": "Module 1",
    "m1desc": "Introduction: \nTypes of vibrations, S.H.M, principle of super position applied to Simple Harmonic Motions. Beats, Fourier theorem and simple problems.",
    "m2": "Module 2",
    "m2desc": "Undamped Free Vibrations: \nSingle degree of freedom systems. Undamped free vibration, natural frequency of free vibration, Spring and Mass elements, effect of mass of spring, Compound Pendulum. \n\nDamped Free Vibrations:\nSingle degree of freedom systems, different types of damping, concept of critical damping and its importance, study of response of viscous damped systems for cases of under damping, critical and over damping, Logarithmic decrement.",
    "m3": "Module 3",
    "m3desc": "Forced Vibration: \nSingle degree of freedom systems, steady state solution with viscous damping due to harmonic force. Solution by Complex algebra, reciprocating and rotating unbalance, vibration isolation, transmissibility ratio. due to harmonic exitation and support motion.",
    "m4": "Module 4",
    "m4desc": "Systems with Two Degrees of Freedom: \nIntroduction, principle modes and Normal modes of vibration, co-ordinate coupling, generalized and principal co-ordinates, Free vibration in terms of initial conditions. Geared systems. Forced Oscillations-Harmonic excitation. Applications: \na)Vehicle suspension.  \nb) Dynamic vibration absorber.  \nc) Dynamics of reciprocating Engines. \n\nContinuous Systems: \nIntroduction, vibration of string, longitudinal vibration of rods, Torsional vibration of rods, Euler’s equation for beams.",
    "m5": "Module 5",
    "m5desc": "Numerical Methods for Multi-Degree Freedom Systems:\nIntroduction, Influence coefficients, Maxwell reciprocal theorem, Dunkerley’s equation. Orthogonality of principal modes, Method of matrix iteration-Method of determination of all the natural frequencies using sweeping matrix and Orthogonality principle. Holzer’s method, Stodola method.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books: \n1. W.T. Thomson and Marie Dillon Dahleh, Theory of Vibration with Applications, Pearson Education 5th edition, 2008,ISBN-13:  978-8131704820. \n2. V.P. Singh ,Mechanical Vibrations, Dhanpat Rai& Company Pvt. Ltd.,2016,ISBN-13: 9788177004014. \n\nReference Books:  \n1. S.S. Rao, Mechanical Vibrations, Pearson Education Inc, 4th Edition,2003,ISBN-13: 9788177588743 \n2. S. Graham Kelly, Mechanical Vibrations- Schaum’s Outline Series, Tata McGraw Hill, Special Indian edition, 2007. \n3. J.S. Rao & K. Gupta, Theory & Practice of Mechanical vibrations, New Age International Publications, New Delhi, 2001.\n4. Leonanrd Meirovitch, Elements of Vibrations Analysis, Tata McGraw Hill, Special Indian edition, 2007.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
