[{
    "_id": "2002",
    "subcode": "17AE563",
    "subname": "AIRCRAFT TRANSPORTATION SYSTEMS",
    "m1": "Module 1",
    "m1desc": "Air Transport Systems –\nIntroduction Environment, transport and mobility.Systematic description and current challenges.Development of aircraft design driver-speed and range.Development of Airport, Airlines, ICAO, Regulatory Frame work and Market Aspects.",
    "m2": "Module 2",
    "m2desc": "Aircraft Characteristics and Manufacturers:\nClassification of flight vehicles, cabin design, basics of flight physics- structures, mass and balance. Flight performance and mission. Aircraft manufacturers, development process, production process, supply chain.",
    "m3": "Module 3",
    "m3desc": "Airlines, Airport and Infrastructure:\nAirline types, Network management. Flight strategy and aircraft selection, flight operations, MRO.Role of Airport, Regulatory Issues, Airport operation and services. Airport planning - infrastructure.",
    "m4": "Module 4",
    "m4desc": "Air Navigation System & Environmental Systems:\nPrinciple of operation- Role of Air Navigation services. Air space structures, Airspace and Airport capacity, Aircraft separation.  Flight guidance system. Communication system. Integrated air traffic management and working system. Environmental aspects-emission, noise, and sound.",
    "m5": "Module 5",
    "m5desc": "Managerial Aspects of Airlines:\nAirline passenger marketing, forecasting methods, pricing and demand. Air cargo-market for air freight.  Principles of airline scheduling. Fleet planning.",
    "descname": "Prescribed text books",
    "descdata": "Text Books:  \n1.Dieter Shmitt, and Valker Gollnick, Air Transport System, Springer, 2016. \n2.Jhon G Wensveen, Air Transportation-A Management Prospective, Ashgate Publishing Ltd, 2011. \n\nReference Books:   \n1.Mike Hirst, The Air Transportation System, Woodhead Publishing Ltd, England, 2008.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
