[
  {
    "id": "1781",
    "subcode": "17CV81",
    "subname": " QUANTITY SURVEYING AND CONTRACTS MANAGEMENT ",
    "m1": "Module 1",
    "m1desc": "Quantity Estimation for Building:study of various drawing attached with estimates, important terms, units of measurements, abstract, Types of estimates - Approximate, detailed, supplementary and revised, Estimation of building - Short wall and long wall method - centre line method. Estimate of R.C.C structures including Slab, beam, column, footings, with bar bending schedule.",
    "m2": "Module 2",
    "m2desc": "Estimate of Steel truss, manhole and septic tanks. Quantity Estimation for Roads: Road estimation, earthwork fully in banking, cutting, partly cutting and partly Filling, Detailed estimate and cost analysis for roads.",
    "m3": "Module 3",
    "m3desc": "Specification for Civil Engineering Works:\nObjective of writing specifications  essentials in specifications, general and detail specifications of different  items of works in buildings.Analysis of Rates:\nFactors Affecting Cost of Civil Works , Concept of Direct Cost , Indirect Cost and Project Cost. Rate analysis and preparation of bills, Data analysis of rates for various items of Works, Sub-structure components, Rate analysis for R.C.C. slabs, columns and beams. ",
    "m4": "Module 4",
    "m4desc": "Contract Management-Tender and its Process:\nInvitation to tender, Prequalification, administrative approval & Technical sanction.  Bid submission and Evaluation process.  Contract Formulation:  covering Award of contract, letter of intent, letter of acceptance and notice to proceed. Features / elements of standard Tender document (source:   PWD / CPWD / International Competitive Bidding – NHAI / NHEPC / NPC).  Law of Contract as per Indian Contract act 1872 , Types of Contract, Entire contract, Lump sum contract, Item rate, % rate, Cost plus with Target, Labour, EPC and BOT, Sub Contracting.Contract Forms : FIDIC contract Forms , CPWD , NHAI , NTPC , NHEPC.",
    "m5": "Module 5",
    "m5desc": "Contract Management-Post award:\nBasic understanding on definitions, Performance security, Mobilization and equipment advances, Secured Advance,  Suspension of work, Time limit for completion, Liquidated damages and bonus, measurement and payment, additions and alterations or variations and deviations, breach of contract, Escalation, settlement of account or final payment, claims, Delay’s and Compensation, Disputes & its resolution mechanism, Contract management and administration.\nValuation:\nDefinitions of terms used in valuation process, Cost, Estimate, Value and its relationship, Capitalized value.  Concept of  supply and demand in respect to properties ( land , building , facilities’),  freehold and lease hold , Sinking fund, depreciation–methods of estimating depreciation, Outgoings, Process  and methods of valuation : Rent fixation,valuation for mortgage, valuation of land.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
  }
]
