[
    {
      "id": "17753",
      "subcode": "17CV753",
      "subname": " REHABILITATION AND RETROFITTING OF STRUCTURES ",
      "m1": "Module 1",
      "m1desc": "General:\nIntroduction and Definition for Repair, Retrofitting, Strengthening and rehabilitation. Physical and Chemical Causes of deterioration of concrete structures, Evaluation of structural damages to the concrete structural elements due to earthquake.",
      "m2": "Module 2",
      "m2desc": "Damage Assessment:\nPurpose of assessment, Rapid assessment, Investigation of damage, Evaluation of surface and structural cracks, Damage assessment procedure, destructive, non-destructive and semi destructive testing systems.",
      "m3": "Module 3",
      "m3desc": "Influence on Serviceability and Durability:\nEffects due to climate, temperature, chemicals, wear and erosion, Design and construction errors, corrosion mechanism, Effects of cover thickness and cracking, methods of corrosion protection, corrosion inhibitors, corrosion resistant steels, coatings, and cathodic protection.",
      "m4": "Module 4",
      "m4desc": "Maintenance and Retrofitting Techniques:\nDefinitions:\nMaintenance, Facts of Maintenance and importance of Maintenance Need for retrofitting, retrofitting of structural members i.e., column and beams by Jacketing technique, Externally bonding(ERB) technique, near surface mounted (NSM) technique, External posttensioning, Section enlargement and guidelines for seismic rehabilitation of existing building.",
      "m5": "Module 5",
      "m5desc": "Materials for Repair and Retrofitting:\nArtificial fibre reinforced polymer like CFRP, GFRP, AFRP and natural fiber like Sisal and Jute. Adhesive like, Epoxy Resin, Special concretes and mortars, concrete chemicals, special elements for accelerated strength gain, Techniques for Repair: Rust eliminators and polymers coating for rebar during repair foamed concrete, mortar and dry pack, vacuum concrete, Gunite and Shot Crete Epoxy injection, Mortar repair for cracks, shoring and underpinning.",
      "descname": "Prescribed text books",
      "descdata": "",
      "notesurl": "",
      "notesscreenname": "NotesListFile",
      "notesscreenparams": "",
      "qpscreentype": "QPaperListFile",
      "qpurl": "",
      "qpscreenparams": "",
      "qbscreentype": "QBankListFile",
      "qburl": "",
      "qbscreenparams": ""
    }
  ]
